data_assignment/foam_cases/13_deg_coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Side
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          47124;
        startFace       46710;
    }
    Inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          400;
        startFace       93834;
    }
    Outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          130;
        startFace       94234;
    }
    Airfoil
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          178;
        startFace       94364;
    }
    Flap
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          120;
        startFace       94542;
    }
)

// ************************************************************************* //
